wisteria-1c/Конфигурация/Catalogs/ДисконтныеКарты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>ДисконтныеКарты</Name>
			<Comment>Магнитные, штриховые и смешанные дисконтные карты</Comment>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.ВидыДисконтныхКарт</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>КодКартыШтрихкод</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодКартыМагнитный</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВладелецКарты</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КартаНедействительна</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

wisteria-1c/Конфигурация/Enums/ТипыКарт.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ТипыКарт</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Магнитная</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Штриховая</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Смешанная</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

wisteria-1c/Конфигурация/Catalogs/ДисконтныеКарты/Forms/ФормаВыбораДублей/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

// Процедура - обработчик события ПриСозданииНаСервере.
//
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЭтаФорма.Заголовок =  НСтр("ru = 'Список дублей по штрихкоду (магнитному коду) и виду карты'");
	ВидКарты = Параметры.Владелец;
	КодКартыМагнитный = Параметры.КодКартыМагнитный;
	КодКартыШтрихкод = Параметры.КодКартыШтрихкод;
	ПроверяемаяДисконтнаяКарта = Параметры.Ссылка;
	
	ЗаполнитьТаблицу();
	УстановитьУсловноеОформление();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

// Процедура - обработчик события Выбор в таблице значений СписокДублей. Открывает форму выбранной дисконтной карты.
//
&НаКлиенте
Процедура СписокДублейВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ПараметрыПередачи = Новый Структура("Ключ", Элемент.ТекущиеДанные.ДисконтнаяКарта);
	ПараметрыПередачи.Вставить("ЗакрыватьПриЗакрытииВладельца", Истина);
	
	ОткрытьФорму("Справочник.ДисконтныеКарты.ФормаОбъекта",
				  ПараметрыПередачи, 
				  Элемент,
				  ,
				  ,
				  ,
				  Новый ОписаниеОповещения("ОбработатьРедактированиеЭлемента", ЭтаФорма));
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Процедура вызывается при закрытии формы дисконтной карты. Открытие формы вызывается из процедуры СписокДублейВыбор
//
&НаКлиенте
Процедура ОбработатьРедактированиеЭлемента(РезультатЗакрытия, ДополнительныеПараметры) Экспорт
	ЗаполнитьТаблицу();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТаблицу()
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ДисконтныеКарты.Ссылка КАК ДисконтнаяКарта,
		|	ДисконтныеКарты.Наименование,
		|	ДисконтныеКарты.КодКартыШтрихкод,
		|	ДисконтныеКарты.КодКартыМагнитный,
		|	ДисконтныеКарты.ВладелецКарты,
		|	ВЫБОР
		|		КОГДА ДисконтныеКарты.КодКартыШтрихкод = &КодКартыШтрихкод
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК НайденПоШтрихКоду,
		|	ВЫБОР
		|		КОГДА ДисконтныеКарты.КодКартыМагнитный = &КодКартыМагнитный
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК НайденПоМагнитномуКоду,
		|	ДисконтныеКарты.Владелец КАК ВидДисконтнойКарты,
		|	ВЫБОР
		|		КОГДА ДисконтныеКарты.ПометкаУдаления
		|			ТОГДА 4
		|		ИНАЧЕ 1
		|	КОНЕЦ КАК Картинка
		|ИЗ
		|	Справочник.ДисконтныеКарты КАК ДисконтныеКарты
		|ГДЕ
		|	ДисконтныеКарты.Владелец = &Владелец
		|	И (ДисконтныеКарты.КодКартыШтрихкод = &КодКартыШтрихкод
		|				И &ПроверятьШтрихкод
		|			ИЛИ ДисконтныеКарты.КодКартыМагнитный = &КодКартыМагнитный
		|				И &ПроверятьМагнитныйКод)
		|	И ДисконтныеКарты.Ссылка <> &Ссылка";
	
	Запрос.УстановитьПараметр("Владелец", ВидКарты);
	Запрос.УстановитьПараметр("КодКартыМагнитный", КодКартыМагнитный);
	Запрос.УстановитьПараметр("КодКартыШтрихкод", КодКартыШтрихкод);
	Запрос.УстановитьПараметр("Ссылка", ПроверяемаяДисконтнаяКарта);
	ТипКарты = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ВидКарты, "ТипКарты");
	Запрос.УстановитьПараметр("ПроверятьШтрихкод", (ТипКарты = Перечисления.ТипыКарт.Штриховая ИЛИ ТипКарты = Перечисления.ТипыКарт.Смешанная) И 
	                                               ЗначениеЗаполнено(КодКартыШтрихкод));
	Запрос.УстановитьПараметр("ПроверятьМагнитныйКод", (ТипКарты = Перечисления.ТипыКарт.Магнитная ИЛИ ТипКарты = Перечисления.ТипыКарт.Смешанная) И 
	                                               ЗначениеЗаполнено(КодКартыМагнитный));
	
	Результат = Запрос.Выполнить();
	ТаблицыДублирующихДисконтныхКарт.Загрузить(Результат.Выгрузить());
КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформление()
	
	// 1. Подсветка поля, занятого другой картой
	НовоеУсловноеОформление = УсловноеОформление.Элементы.Добавить();
	
	Оформление = НовоеУсловноеОформление.Оформление.Элементы.Найти("ЦветТекста");
	Оформление.Значение 		= ЦветаПалитры.Красный;
	Оформление.Использование 	= Истина;
	
	ОформляемоеПоля = НовоеУсловноеОформление.Поля.Элементы.Добавить();
	ОформляемоеПоля.Поле = Новый ПолеКомпоновкиДанных("ТаблицыДублирующихДисконтныхКартКодКартыШтрихкод");

	Отбор = НовоеУсловноеОформление.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	Отбор.ВидСравнения 		= ВидСравненияКомпоновкиДанных.Равно;
	Отбор.Использование 	= Истина;
	Отбор.ЛевоеЗначение 	= Новый ПолеКомпоновкиДанных("ТаблицыДублирующихДисконтныхКарт.НайденПоШтрихКоду");
	Отбор.ПравоеЗначение 	= Истина;

	// 2. Подсветка поля, занятого другой картой
	НовоеУсловноеОформление = УсловноеОформление.Элементы.Добавить();
	
	Оформление = НовоеУсловноеОформление.Оформление.Элементы.Найти("ЦветТекста");
	Оформление.Значение 		= ЦветаПалитры.Красный;
	Оформление.Использование 	= Истина;
	
	ОформляемоеПоля = НовоеУсловноеОформление.Поля.Элементы.Добавить();
	ОформляемоеПоля.Поле = Новый ПолеКомпоновкиДанных("ТаблицыДублирующихДисконтныхКартКодКартыМагнитный");
	
	Отбор = НовоеУсловноеОформление.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	Отбор.ВидСравнения 		= ВидСравненияКомпоновкиДанных.Равно;
	Отбор.Использование 	= Истина;
	Отбор.ЛевоеЗначение 	= Новый ПолеКомпоновкиДанных("ТаблицыДублирующихДисконтныхКарт.НайденПоМагнитномуКоду");
	Отбор.ПравоеЗначение 	= Истина;
	//
КонецПроцедуры

#КонецОбласти
